import streamlit as st

st.markdown(
    """
    <style>
    .video-bg {
        position: fixed;
        right: 0;
        bottom: 0;
        min-width: 100%;
        min-height: 100%;
        z-index: -1;
        object-fit: cover;
    }
    </style>

    <video autoplay muted loop class="video-bg">
        <source src="https://www.w3schools.com/howto/rain.mp4" type="video/mp4">
    </video>
    """,
    unsafe_allow_html=True
)

if st.button("Click for surprise", use_container_width=True):
	st.balloons()
	mdd = """
	:orange[████████████████████████████████████████████████████████]

:violet[
██╗  ██╗ █████╗ ██████╗ ██████╗ ██╗   ██╗
██║  ██║██╔══██╗██╔══██╗██╔══██╗╚██╗ ██╔╝
███████║███████║██████╔╝██████╔╝ ╚████╔╝ 
██╔══██║██╔══██║██╔═══╝ ██╔═══╝   ╚██╔╝  
██║  ██║██║  ██║██║     ██║        ██║   
╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝        ╚═╝   
]

:blue[
██████╗ ██╗██████╗ ████████╗██╗  ██╗██████╗  █████╗ ██╗   ██╗
██╔══██╗██║██╔══██╗╚══██╔══╝██║  ██║██╔══██╗██╔══██╗╚██╗ ██╔╝
██████╔╝██║██████╔╝   ██║   ███████║██║  ██║███████║ ╚████╔╝ 
██╔══██╗██║██╔══██╗   ██║   ██╔══██║██║  ██║██╔══██║  ╚██╔╝  
██████╔╝██║██║  ██║   ██║   ██║  ██║██████╔╝██║  ██║   ██║   
╚═════╝ ╚═╝╚═╝  ╚═╝   ╚═╝   ╚═╝  ╚═╝╚═════╝ ╚═╝  ╚═╝   ╚═╝   
]

:rainbow[
██████╗  █████╗ ██████╗ ██████╗ ██╗   ██╗
██╔══██╗██╔══██╗██╔══██╗██╔══██╗╚██╗ ██╔╝
██║  ██║███████║██║  ██║██║  ██║ ╚████╔╝ 
██║  ██║██╔══██║██║  ██║██║  ██║  ╚██╔╝  
██████╔╝██║  ██║██████╔╝██████╔╝   ██║   
╚═════╝ ╚═╝  ╚═╝╚═════╝ ╚═════╝    ╚═╝   
]
:green[
🎂 🎉 🎈  W I S H I N G   Y O U   V E R Y   H A P P Y   B I R T H D A Y   D A D D Y
]

:red[
❤  S M I L E S   |   J O Y   |   S U C C E S S   |   H A P P I N E S S  ❤
]

:orange[
████████████████████████████████████████████████████████
]
"""
	st.markdown(mdd, unsafe_allow_html=True)
	st.audio("audio.mp3", autoplay=True)


